app/controllers/accounts_controller.rb

  def signup
   	@user = User.new
    if request.post?
      @user = User.new(params[:user])
      if @user.save
---
INSERT INTO `users` (`created_at`, `hashed_password`, `login_email`, `login_name`, `updated_at`) VALUES ('2013-12-13 05:35:02', '5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8', 'pdahal@outlook.com', 'Puru Dahal', '2013-12-13 05:35:02')

  def dashboard
    @user = User.find(session[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]