app/controllers/carts_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def create
    # Amount in cents
    @amount = params[:amount_to_capture]#check _cart.html.erb for hidden form [:amount_to_capture]
    @user = User.find(session[:user])