app/controllers/gallery_controller.rb

	def index
		@space_gallery = ListSpace.all
---
SELECT `list_spaces`.* FROM `list_spaces`

	def detail
	    @space_detail = ListSpace.find(params[:id]) #.all
---
SELECT "list_spaces".* FROM "list_spaces" WHERE "list_spaces"."id" = ? LIMIT 1  [["id", "1"]]