app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    list_space = ListSpace.find(params[:id])
    @line_item = @cart.add_space(list_space.id)
    @line_item.month = params[:no_of_months]

    respond_to do |format|
      if @line_item.save
---
SELECT "list_spaces".* FROM "list_spaces" WHERE "list_spaces"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 16 Dec 2013 05:47:36 UTC +00:00], ["updated_at", Mon, 16 Dec 2013 05:47:36 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "list_space_id", "month", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 1], ["created_at", Mon, 16 Dec 2013 05:47:36 UTC +00:00], ["list_space_id", 1], ["month", 1], ["updated_at", Mon, 16 Dec 2013 05:47:36 UTC +00:00]]