app/controllers/list_spaces_controller.rb

SELECT `list_spaces`.* FROM `list_spaces`
---
  def index
    @list_spaces = ListSpace.all

SELECT "list_spaces".* FROM "list_spaces" WHERE "list_spaces"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @list_space = ListSpace.find(params[:id])

SELECT "list_spaces".* FROM "list_spaces" WHERE "list_spaces"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @list_space = ListSpace.find(params[:id])

INSERT INTO `list_spaces` (`address1`, `address2`, `area`, `available_date`, `city`, `created_at`, `description`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `price`, `state`, `updated_at`, `zipcode`) VALUES ('123 Main St', 'Building # 4', 1000.0, '2013-12-13', 'Houston', '2013-12-13 01:41:16', 'Description', 'image/jpeg', 'Tampa_Storefront_4x6.jpg', 2816578, '2013-12-13 01:41:16', 1500, 'TX', '2013-12-13 01:41:16', '77433')
---
  def create
    @list_space = ListSpace.new(params[:list_space])

    respond_to do |format|
      if @list_space.save

SELECT "list_spaces".* FROM "list_spaces" WHERE "list_spaces"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "list_spaces" SET "image_file_name" = 'Tampa_Storefront_4x6.jpg', "image_file_size" = 2816578, "image_updated_at" = '2013-12-16 17:29:48.691095', "updated_at" = '2013-12-16 17:29:48.692516' WHERE "list_spaces"."id" = 1
---
  def update
    @list_space = ListSpace.find(params[:id])

    respond_to do |format|
      if @list_space.update_attributes(params[:list_space])